#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
/*
	char		//字符数据类型
	short		//短整型
	int			//整形
	long		//长整型
	long long	//更长的整形
	float		//单精度浮点数
	double		//双精度浮点数
*/
/*
	char 
		unsigned char
		signed char
	short
		unsigned short
		signed short
	int 
		unsigned int 
		signed int
	long
		unsigned long
		signed long
	

int main()
{
	int a = 20;
	int b = -10;
	// 4个字节32bit
	//10000000 00000000 00000000 00001010 - 原码
	//11111111 11111111 11111111 11110101 - 反码
	//11111111 11111111 11111111 11110110 - 补码
	//fffffff6
	return 0;
}*/
//1 - 1 = 0;
//1 + (-1) = 0
//原码计算
//00000000 00000000 00000000 00000001   1
//10000000 00000000 00000000 00000001   -1
//10000000 00000000 00000000 00000010   -2//错误！
//补码计算
//00000000 00000000 00000000 00000001   1
//11111111 11111111 11111111 11111111   -1
//10000000 00000000 00000000 000000000 //33 bit,丢掉高位
//00000000 00000000 00000000 000000000  0
//
/*
int main()
{
	int a = 1;
	char *pa =(char*)&a;
	if (*pa == 1)
		printf("小端\n");
	else
		printf("大端\n");

	return 0;
}
int check_sys()
{
	int a = 1;
	return *(char*)&a;
}
int main()
{
	if (check_sys() == 1)
		printf("小端\n");
	else
		printf("大端\n");
	return 0;
}
int main()
{
	//int 32bit
	//char 8bit
	//截断
	char a = -1;
	//10000000 00000000 00000000 00000001 -原
	//11111111 11111111 11111111 11111110 - 反
	//11111111 11111111 11111111 11111111 - 补
	//11111111 - a(截断)
	//11111111 11111111 11111111 11111111  - 补//打印整型-》提升
	//11111111 11111111 11111111 11111110 - 反
	//10000000 00000000 00000000 00000001 - 原
	//-1
	signed char b = -1;
	unsigned char c = -1;
	//11111111 - c
	//00000000 00000000 00000000 11111111 -补//打印整型-》提升
	//正数原、反、补相同
	//255
	printf("a = %d,b = %d,c = %d\n", a, b, c);
	//a = -1,b = -1，c = 255
	return 0;
}
int main()
{
	char a = -128;
	//10000000 00000000 00000000 10000000 - 原
	//11111111 11111111 11111111 01111111 - 反
	//11111111 11111111 11111111 11111110 - 补
	//10000000 - a
	//%u ->无符号整数
	//11111111 11111111 11111111 10000000 - 补
	//无符号原、反、补相同
	printf("%u\n", a);
	//4294967168
	return 0;
}
int main()
{
	char a = 128;
	//00000000 00000000 00000000 10000000 - 原
	//11111111 11111111 11111111 01111111 - 反
	//11111111 11111111 11111111 11111110 - 补
	//10000000 - a
	//%u ->无符号整数
	//11111111 11111111 11111111 10000000 - 补
	//无符号原、反、补相同
	printf("%u\n", a);
	//4294967168
	return 0;
}
int main()
{
	int i = -20;
	//10000000 00000000 00000000 00010100 - 原
	//11111111 11111111 11111111 11101011 - 反
	//11111111 11111111 11111111 11101100 - 补
	unsigned int j = 10;
	//00000000 00000000 00000000 00001010 - 原、反、补
	//11111111 11111111 11111111 11111110 - i+j
	//11111111 11111111 11111111 11110101 - 反
	//10000000 00000000 00000000 00001010 - 原
	printf("%d\n", i + j);
	//-10
	return 0;
}
int main()
{
	unsigned int i;
	//i 是无符号整形，永远大于0
	for (i = 9; i >= 0; i--)
		printf("%u\n", i);
	//死循环
	return 0;
}
int main()
{
	char a[1000];
	int i;
	for(i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d\n", strlen(a));
	return 0;
}
unsigned char i = 0;//0-255
int main()
{
	for (i = 0; i < 255; i++)
		printf("hello world\n");
	//死循环
	return 0;
}

int main()
{
	float f = 5.5;
	//101.1;
	//1.011 * 2^2;
	//(-1)^0 * 2 * 1.011 * 2^2
	//S = 0;
	//M = 1.011
	//E = 2
	//2 + 127 = 129
	//0 10000001 01100000000000000000000
	//40 B0 00 00h
}
//9.5
//1001.1
//1.0011 * 2^3
//(-1)^0 * 1.0011 * 2^3
//S = 0
//M = 1.0011
//E = 3+127 = 130*/
int main()
{
	int n = 9;
	//0 0000000 000000000000000000001001
	//(-1)^0 * 0.000000000000000000001001 * 2^(1-127)
	float *pf = (float*)&n;
	printf("n的值为：%d\n", n);
	printf("*pf的值为：%f\n", *pf);
	*pf = 9.0;
	//(-1)^0*1.001 * 2^3
	//S = 0
	//M = 1.001
	//E = 3 + 127
	//0 10000010 00100000000000000000000
	//0 10000010 00100000000000000000000 - 正数的原、反、补
	printf("n的值是： %d\n", n);//1091567616
	printf("*pf的值为：%f\n", *pf);
	return 0;
	
}
